[
  {
    "claim_text": "Cyclone Ditwah caused an estimated $4.1 billion in direct physical damage to buildings, agriculture, and critical infrastructure in Sri Lanka.",
    "claim_category": "economic_impact",
    "confidence": 0.98
  },
  {
    "claim_text": "The death toll from Cyclone Ditwah rose to 607, with 214 people still missing and over 2.08 million affected nationwide.",
    "claim_category": "casualties_and_displacement",
    "confidence": 0.99
  },
  {
    "claim_text": "Over 275,000 children were affected by Cyclone Ditwah, facing an escalating humanitarian crisis due to floods and devastation.",
    "claim_category": "casualties_and_displacement",
    "confidence": 0.97
  },
  {
    "claim_text": "The Sri Lankan government announced compensation of Rs. 5 million for each home destroyed by Cyclone Ditwah-related flooding or landslides.",
    "claim_category": "government_response",
    "confidence": 0.95
  },
  {
    "claim_text": "President Anura Kumara Dissanayake appointed a Presidential Task Force to lead rehabilitation, recovery, and reconstruction efforts in areas affected by Cyclone Ditwah.",
    "claim_category": "government_response",
    "confidence": 0.98
  },
  {
    "claim_text": "India provided over 300 tonnes of humanitarian relief assistance to Sri Lanka under Operation Sagar Bandhu, including rescue, medical support, and essential relief distribution.",
    "claim_category": "international_response",
    "confidence": 0.99
  },
  {
    "claim_text": "The U.S. military deployed C-130J aircraft and logistics teams to assist in delivering critical supplies and support disaster relief efforts in Sri Lanka.",
    "claim_category": "international_response",
    "confidence": 0.96
  },
  {
    "claim_text": "Japan sent a 27-member Disaster Relief Medical Team and provided $1 million worth of shelters through IOM to support recovery efforts after Cyclone Ditwah.",
    "claim_category": "international_response",
    "confidence": 0.97
  },
  {
    "claim_text": "Russia pledged 35 tonnes of humanitarian aid, and Saudi Arabia expressed condolences and support to Sri Lanka following Cyclone Ditwah.",
    "claim_category": "international_response",
    "confidence": 0.95
  },
  {
    "claim_text": "Cyclone Ditwah disrupted communication services, with 80% restored but ongoing disaster conditions slowing full recovery of fibre-optic networks.",
    "claim_category": "infrastructure_damage",
    "confidence": 0.98
  },
  {
    "claim_text": "Nearly 1,500 bus journeys operated by the Sri Lanka Transport Board were cancelled due to roadblocks caused by Cyclone Ditwah.",
    "claim_category": "infrastructure_damage",
    "confidence": 0.96
  },
  {
    "claim_text": "The Department of Irrigation began urgent work to restore canals and reservoirs damaged by Cyclone Ditwah to resume water supply to farmlands.",
    "claim_category": "infrastructure_damage",
    "confidence": 0.95
  },
  {
    "claim_text": "The Asian Development Bank launched a $40 million emergency trade finance facility to aid Sri Lanka’s recovery from Cyclone Ditwah.",
    "claim_category": "economic_impact",
    "confidence": 0.97
  },
  {
    "claim_text": "The IMF announced the release of a $350 million tranche from its Extended Fund Facility to support post-cyclone relief efforts in Sri Lanka.",
    "claim_category": "economic_impact",
    "confidence": 0.96
  },
  {
    "claim_text": "Cyclone Ditwah was unusual as it developed near Sri Lanka, approximately 650 km north of the equator, breaking the norm of cyclones forming at least 500 km away.",
    "claim_category": "infrastructure_damage",
    "confidence": 0.94
  }
]