[
  {
    "claim_text": "The Sri Lankan government declared 22 districts as national disaster zones following Cyclone Ditwah.",
    "claim_category": "government_response",
    "confidence": 0.98
  },
  {
    "claim_text": "International aid included financial and material support from countries such as India, Australia, Japan, the UK, and the UAE, as well as organizations like WHO and UNICEF.",
    "claim_category": "international_response",
    "confidence": 0.98
  },
  {
    "claim_text": "Cyclone Ditwah resulted in a death toll of 638 people, with 192 individuals listed as missing.",
    "claim_category": "casualties_and_displacement",
    "confidence": 0.98
  },
  {
    "claim_text": "India pledged a $450 million assistance package, including a $100 million grant and $350 million in concessional credit, to support Sri Lanka's post-cyclone reconstruction efforts.",
    "claim_category": "international_response",
    "confidence": 0.98
  },
  {
    "claim_text": "India provided humanitarian assistance under 'Operation Sagar Bandhu,' including search and rescue efforts and relief provisions.",
    "claim_category": "international_response",
    "confidence": 0.97
  },
  {
    "claim_text": "India provided over 1,000 tonnes of humanitarian aid under Operation Sagar Bandhu, including the deployment of warships, helicopters, and medical support for cyclone relief efforts.",
    "claim_category": "humanitarian_aid",
    "confidence": 0.97
  },
  {
    "claim_text": "The government established a 'Rebuilding Sri Lanka Fund' with public and private sector representation to manage recovery efforts.",
    "claim_category": "government_response",
    "confidence": 0.96
  },
  {
    "claim_text": "China, Pakistan, Russia, Qatar, Australia, Switzerland, and the UAE provided humanitarian aid, including relief supplies, financial assistance, and food aid, totaling millions of dollars in support.",
    "claim_category": "international_response",
    "confidence": 0.96
  },
  {
    "claim_text": "At least 334 people have been confirmed dead across Sri Lanka as a result of Cyclone Ditwah.",
    "claim_category": "casualties_and_displacement",
    "confidence": 0.95
  },
  {
    "claim_text": "India launched 'Operation Sagar Bandhu,' a large-scale humanitarian relief mission, to assist Sri Lanka after Cyclone Ditwah, including the deployment of INS Vikrant helicopters and medical aid.",
    "claim_category": "humanitarian_aid",
    "confidence": 0.95
  },
  {
    "claim_text": "The Sri Lankan government declared a state of emergency in response to the widespread destruction caused by Cyclone Ditwah.",
    "claim_category": "government_response",
    "confidence": 0.95
  },
  {
    "claim_text": "The United States announced a $2 million aid package to support Sri Lanka’s flood relief efforts following Cyclone Ditwah.",
    "claim_category": "international_response",
    "confidence": 0.95
  },
  {
    "claim_text": "Cyclone Ditwah resulted in 366 deaths and 367 people reported missing, with the highest casualties from Kandy and Badulla districts.",
    "claim_category": "casualties_and_displacement",
    "confidence": 0.95
  },
  {
    "claim_text": "UNICEF reported that over 275,000 children were affected by Cyclone Ditwah, requiring urgent humanitarian support.",
    "claim_category": "humanitarian_aid",
    "confidence": 0.95
  },
  {
    "claim_text": "Cyclone Ditwah resulted in 474 deaths and 356 missing persons, according to the Disaster Management Centre (DMC).",
    "claim_category": "casualties_and_displacement",
    "confidence": 0.95
  },
  {
    "claim_text": "International donors, including the UK, Australia, China, India, Pakistan, Japan, and the UAE, provided emergency aid, medical teams, and relief supplies totaling millions of dollars to support Cyclone Ditwah recovery efforts.",
    "claim_category": "international_response",
    "confidence": 0.95
  },
  {
    "claim_text": "Cyclone Ditwah resulted in 618 deaths and 209 missing persons, with 2 million people affected nationwide.",
    "claim_category": "casualties_and_displacement",
    "confidence": 0.95
  },
  {
    "claim_text": "International aid included USD 200 million emergency funding requested from the IMF, USD 100 million loan and USD 3 million grant from the ADB, and relief supplies from countries like India, the US, Pakistan, Japan, and South Korea.",
    "claim_category": "international_response",
    "confidence": 0.95
  },
  {
    "claim_text": "Over 5,325 houses were completely destroyed, and 68,074 houses were partially damaged across Sri Lanka due to Cyclone Ditwah.",
    "claim_category": "infrastructure_damage",
    "confidence": 0.95
  },
  {
    "claim_text": "The United Nations allocated $4.5 million from its Central Emergency Response Fund to support post-cyclone relief and recovery efforts in Sri Lanka.",
    "claim_category": "international_response",
    "confidence": 0.95
  },
  {
    "claim_text": "Cyclone Ditwah caused widespread devastation across Sri Lanka, with a death toll rising to 639 and 211 people still missing.",
    "claim_category": "casualties_and_displacement",
    "confidence": 0.95
  },
  {
    "claim_text": "International humanitarian aid included $1.3 million from the UK, €500,000 from Germany, $500,000 from Australia, 35 metric tons of aid from Russia, and a $200 million loan from the Asian Development Bank for recovery efforts.",
    "claim_category": "international_response",
    "confidence": 0.95
  },
  {
    "claim_text": "The death toll from Cyclone Ditwah rose to 640, with 184 people still missing.",
    "claim_category": "casualties_and_displacement",
    "confidence": 0.95
  },
  {
    "claim_text": "International humanitarian aid included over 300 tonnes of assistance from India, $120 million emergency support from the World Bank, $100,000 from Singapore, and relief teams from the UAE, alongside medical and logistical support from the WHO and Doctors Without Borders (MSF).",
    "claim_category": "international_response",
    "confidence": 0.95
  },
  {
    "claim_text": "Around 18,000 businesses were affected due to the effects of Cyclone Ditwah.",
    "claim_category": "economic_impact",
    "confidence": 0.95
  },
  {
    "claim_text": "The Road Development Authority (RDA) incurred a loss of around Rs. 75 billion due to Cyclone Ditwah.",
    "claim_category": "infrastructure_damage",
    "confidence": 0.95
  },
  {
    "claim_text": "The World Bank pledged $120 million in emergency support to Sri Lanka for post-Cyclone Ditwah recovery, repurposing funds from ongoing projects.",
    "claim_category": "international_response",
    "confidence": 0.95
  },
  {
    "claim_text": "73 children have lost one or both parents due to disasters caused by Cyclone Ditwah.",
    "claim_category": "casualties_and_displacement",
    "confidence": 0.95
  },
  {
    "claim_text": "The IMF Executive Board approved $206 million in emergency financial support for Sri Lanka under the Rapid Financing Instrument (RFI) to address urgent needs arising from Cyclone Ditwah.",
    "claim_category": "international_response",
    "confidence": 0.95
  },
  {
    "claim_text": "Cyclone Ditwah caused an estimated $4.1 billion in direct physical damage across Sri Lanka, equivalent to approximately 4% of the country's GDP.",
    "claim_category": "infrastructure_damage",
    "confidence": 0.95
  },
  {
    "claim_text": "UNICEF delivered 1,500 emergency BP-5 nutrition packs to support children affected by Cyclone Ditwah.",
    "claim_category": "humanitarian_aid",
    "confidence": 0.95
  },
  {
    "claim_text": "The International Labour Organization (ILO) estimates that up to 374,000 workers were affected by Cyclone Ditwah in Sri Lanka.",
    "claim_category": "economic_impact",
    "confidence": 0.95
  },
  {
    "claim_text": "President Anura Kumara Dissanayake appointed a Presidential Task Force to lead rehabilitation and recovery efforts after Cyclone Ditwah.",
    "claim_category": "government_response",
    "confidence": 0.95
  },
  {
    "claim_text": "Telecom operators, in coordination with government authorities, accelerated the restoration of connectivity, with 949 main transmission towers targeted for repair.",
    "claim_category": "infrastructure_damage",
    "confidence": 0.94
  },
  {
    "claim_text": "The Sri Lankan government established the 'Rebuilding Sri Lanka Fund' as a statutory mechanism for recovery, with over Rs. 1.89 billion raised from local and international donors.",
    "claim_category": "government_response",
    "confidence": 0.94
  },
  {
    "claim_text": "A group of 120 economists, including Nobel laureate Joseph Stiglitz, called for a halt to Sri Lanka's debt repayments following the devastation caused by Cyclone Ditwah.",
    "claim_category": "economic_impact",
    "confidence": 0.94
  },
  {
    "claim_text": "Over 1.1 million people were affected by Cyclone Ditwah, with telecommunications and road infrastructure severely disrupted but gradually restored.",
    "claim_category": "infrastructure_damage",
    "confidence": 0.93
  },
  {
    "claim_text": "Moody's reported that Sri Lanka faces significant credit impact from Cyclone Ditwah due to its weakened fiscal capacity to increase resilience.",
    "claim_category": "economic_impact",
    "confidence": 0.93
  },
  {
    "claim_text": "Over 106,000 hectares of paddy, about 20% of the Maha season sowings, were damaged by Cyclone Ditwah, according to the Food and Agriculture Organization (FAO).",
    "claim_category": "infrastructure_damage",
    "confidence": 0.93
  },
  {
    "claim_text": "The Colombo stock market lost Rs. 240 billion in value initially but recouped 30% of the loss in subsequent trading sessions.",
    "claim_category": "economic_impact",
    "confidence": 0.92
  },
  {
    "claim_text": "The United Nations Development Programme (UNDP) reported that Cyclone Ditwah flooded over 1.1 million hectares (20% of Sri Lanka's land), affecting 2.3 million people, including over 50% women.",
    "claim_category": "infrastructure_damage",
    "confidence": 0.92
  },
  {
    "claim_text": "The International Labour Organization (ILO) estimated that Cyclone Ditwah affected 374,000 workers in Sri Lanka, with potential income losses of $48 million per month.",
    "claim_category": "economic_impact",
    "confidence": 0.92
  },
  {
    "claim_text": "The government announced compensation for farmers, with 131,742 hectares of crops damaged, and allocated Rs. 200,000 to restart industries affected by the cyclone.",
    "claim_category": "government_response",
    "confidence": 0.91
  },
  {
    "claim_text": "Over 200 people remain missing following the adverse weather conditions caused by Cyclone Ditwah.",
    "claim_category": "casualties_and_displacement",
    "confidence": 0.9
  },
  {
    "claim_text": "Approximately 175,000 people were left without power across Sri Lanka due to Cyclone Ditwah.",
    "claim_category": "infrastructure_damage",
    "confidence": 0.9
  },
  {
    "claim_text": "Over 998,000 people were affected by severe weather conditions, with more than 180,000 individuals displaced and sheltering in 1,275 safety centers.",
    "claim_category": "casualties_and_displacement",
    "confidence": 0.9
  },
  {
    "claim_text": "The Sri Lankan government established a joint operations center, the Centre for Ground Emergency Situations (CGES), to coordinate recovery efforts post-Cyclone Ditwah.",
    "claim_category": "government_response",
    "confidence": 0.9
  },
  {
    "claim_text": "The economic cost of Cyclone Ditwah is estimated to reach 1-3% of Sri Lanka's GDP, with calls for capital-market solutions to fund recovery.",
    "claim_category": "economic_impact",
    "confidence": 0.9
  },
  {
    "claim_text": "The Sri Lankan government established a 'Rebuilding Sri Lanka' fund to support post-cyclone recovery, with contributions exceeding Rs. 700 million from various sources, including overseas workers and corporations.",
    "claim_category": "government_response",
    "confidence": 0.9
  },
  {
    "claim_text": "The IMF announced the swift release of a $350 million tranche under the Extended Fund Facility (EFF) to support Sri Lanka's post-cyclone recovery and economic stabilization.",
    "claim_category": "economic_impact",
    "confidence": 0.9
  },
  {
    "claim_text": "The Sri Lankan government allocated Rs. 10 billion in the initial phase to provide financial relief to people affected by Cyclone Ditwah.",
    "claim_category": "government_response",
    "confidence": 0.9
  },
  {
    "claim_text": "Over 200,000 hectares of crops, including 137,000 hectares of paddy (22% of cultivated area), were destroyed due to Cyclone Ditwah.",
    "claim_category": "economic_impact",
    "confidence": 0.9
  },
  {
    "claim_text": "The Ceylon Electricity Board (CEB) reported that 40% of its infrastructure was damaged by Cyclone Ditwah, with 86% of affected consumers reconnected by the time of reporting.",
    "claim_category": "infrastructure_damage",
    "confidence": 0.9
  },
  {
    "claim_text": "The US deployed two C-130J Super Hercules aircraft and personnel to assist in Cyclone Ditwah relief operations, including delivering critical supplies.",
    "claim_category": "international_response",
    "confidence": 0.9
  },
  {
    "claim_text": "India delivered a 110-ft-long Bailey Bridge and over 300 tons of humanitarian relief assistance to Sri Lanka under 'Operation Sagar Bandhu'.",
    "claim_category": "international_response",
    "confidence": 0.9
  },
  {
    "claim_text": "The Marine Environment Protection Authority (MEPA) reported that 143 km of Sri Lanka's coastline was polluted following Cyclone Ditwah, prompting a major cleanup effort.",
    "claim_category": "infrastructure_damage",
    "confidence": 0.9
  },
  {
    "claim_text": "The Sri Lankan government activated emergency response components within ongoing World Bank projects and approved a Rs. 25,000 allowance for cleaning places of worship affected by Cyclone Ditwah.",
    "claim_category": "government_response",
    "confidence": 0.9
  },
  {
    "claim_text": "Cyclone Ditwah severely damaged infrastructure, including over two-thirds of Sri Lanka's rail tracks, 143.03 km of coastline pollution, and 147 schools being used as temporary relief shelters.",
    "claim_category": "infrastructure_damage",
    "confidence": 0.9
  },
  {
    "claim_text": "Over 6,000 homes were completely destroyed across Sri Lanka due to Cyclone Ditwah, with more than 20,000 families displaced and over 70,000 people still in relief centers.",
    "claim_category": "infrastructure_damage",
    "confidence": 0.9
  },
  {
    "claim_text": "The Sri Lankan government allocated Rs. 5 million per household for reconstruction and disbursed over Rs. 13 billion in relief funds, while establishing the 'Rebuilding Sri Lanka' Fund, which exceeded Rs. 3.4 billion in contributions.",
    "claim_category": "government_response",
    "confidence": 0.9
  },
  {
    "claim_text": "Over 20,000 families were displaced by Cyclone Ditwah, with many housed in temporary disaster displacement centers.",
    "claim_category": "casualties_and_displacement",
    "confidence": 0.9
  },
  {
    "claim_text": "The Sri Lankan government granted special leave to state officials affected by Cyclone Ditwah and convened the National Council for Disaster Management to coordinate recovery efforts.",
    "claim_category": "government_response",
    "confidence": 0.9
  },
  {
    "claim_text": "Over 106,800 hectares of paddy were destroyed by Cyclone Ditwah.",
    "claim_category": "infrastructure_damage",
    "confidence": 0.9
  },
  {
    "claim_text": "The government allocated Rs. 500 billion in a supplementary estimate for 2026 to manage expenditures related to Cyclone Ditwah recovery efforts.",
    "claim_category": "government_response",
    "confidence": 0.9
  },
  {
    "claim_text": "Over 250,000 families received a Rs. 25,000 allowance for house cleaning after being affected by Cyclone Ditwah.",
    "claim_category": "humanitarian_aid",
    "confidence": 0.9
  },
  {
    "claim_text": "Japan provided $2.5 million in emergency grant aid for Cyclone Ditwah relief efforts through the International Organization for Migration (IOM).",
    "claim_category": "international_response",
    "confidence": 0.9
  },
  {
    "claim_text": "The Asian Development Bank (ADB) launched a $40 million emergency assistance facility for Sri Lanka after Cyclone Ditwah.",
    "claim_category": "international_response",
    "confidence": 0.9
  },
  {
    "claim_text": "1,382 schools were directly affected by Cyclone Ditwah, primarily in the Central, Uva, and Sabaragamuwa provinces.",
    "claim_category": "infrastructure_damage",
    "confidence": 0.9
  },
  {
    "claim_text": "The Sri Lankan government disbursed Rs. 106.2 million in the first phase of relief assistance to 531 industrialists affected by Cyclone Ditwah.",
    "claim_category": "government_response",
    "confidence": 0.9
  },
  {
    "claim_text": "More than 838 kilometers of electric fences, valued at around Rs. 157 million, were damaged due to Cyclone Ditwah.",
    "claim_category": "infrastructure_damage",
    "confidence": 0.9
  },
  {
    "claim_text": "Cyclone Ditwah caused 639 deaths, with 180 people still reported missing.",
    "claim_category": "casualties_and_displacement",
    "confidence": 0.9
  },
  {
    "claim_text": "The Sri Lankan government granted Rs. 500,000 to each household affected by Cyclone Ditwah without individual assessments.",
    "claim_category": "government_response",
    "confidence": 0.9
  },
  {
    "claim_text": "India extended $350 million in concessional credit lines and an additional $100 million grant to Sri Lanka for post-cyclone recovery.",
    "claim_category": "international_response",
    "confidence": 0.9
  },
  {
    "claim_text": "Floods caused by Cyclone Ditwah damaged over 36,900 hectares of agricultural land, with compensation paid to more than 83,800 farmers.",
    "claim_category": "infrastructure_damage",
    "confidence": 0.9
  },
  {
    "claim_text": "A Fundamental Rights petition was filed before the Supreme Court accusing authorities of failing to take preventive measures to minimize the impact of Cyclone Ditwah.",
    "claim_category": "government_response",
    "confidence": 0.9
  },
  {
    "claim_text": "SLT MOBITEL restored over 98% of telecommunication sites impacted by Cyclone Ditwah.",
    "claim_category": "infrastructure_damage",
    "confidence": 0.9
  },
  {
    "claim_text": "The fisheries sector in Sri Lanka suffered losses estimated between Rs. 20.5 billion and Rs. 28 billion due to Cyclone Ditwah.",
    "claim_category": "economic_impact",
    "confidence": 0.88
  },
  {
    "claim_text": "Cyclone Ditwah caused extensive disruption to fiber-optic cables and communication networks, leaving parts of Sri Lanka offline.",
    "claim_category": "infrastructure_damage",
    "confidence": 0.85
  },
  {
    "claim_text": "The Colombo stock market experienced a steep decline in the wake of Cyclone Ditwah, reflecting economic disruptions.",
    "claim_category": "economic_impact",
    "confidence": 0.85
  },
  {
    "claim_text": "Cyclone Ditwah caused severe infrastructure damage, including over 65% of the railway network being non-operational, major road closures (e.g., Kandy-Colombo road), and 56% of electricity connections disrupted.",
    "claim_category": "infrastructure_damage",
    "confidence": 0.85
  },
  {
    "claim_text": "The government announced a Rs. 200,000 grant to disaster-affected industries for rapid recovery as part of its relief program.",
    "claim_category": "government_response",
    "confidence": 0.85
  },
  {
    "claim_text": "Nearly 1,000 schools and 33 state hospitals were fully or partially damaged due to Cyclone Ditwah.",
    "claim_category": "infrastructure_damage",
    "confidence": 0.85
  },
  {
    "claim_text": "The agricultural sector suffered a forecasted production drop of 30-35% in high-grown and mid-grown teas, and 10-15% in low-grown teas due to Cyclone Ditwah.",
    "claim_category": "economic_impact",
    "confidence": 0.85
  },
  {
    "claim_text": "The Disaster Management Center (DMC) reported that 4,517 houses were completely destroyed across the country due to Cyclone Ditwah.",
    "claim_category": "casualties_and_displacement",
    "confidence": 0.85
  },
  {
    "claim_text": "The government issued a Budget Circular with an extensive relief package for Cyclone Ditwah, financed mainly through the Defence Ministry and implemented via Divisional Secretariats.",
    "claim_category": "government_response",
    "confidence": 0.85
  },
  {
    "claim_text": "The economic impact of Cyclone Ditwah included the introduction of 3-year loans at 3% annual interest for MSMEs, a drop in liquid milk supply due to livestock losses, and a bullish surge in the Colombo Stock Exchange amid recovery efforts.",
    "claim_category": "economic_impact",
    "confidence": 0.85
  },
  {
    "claim_text": "Cyclone Ditwah severely damaged Sri Lanka’s railway infrastructure, with losses estimated in billions of rupees and repairs expected to take over a year, while also disrupting food production, MSMEs, and tourism, delaying economic recovery.",
    "claim_category": "economic_impact",
    "confidence": 0.85
  },
  {
    "claim_text": "More than 1,000 religious, cultural, and archaeological sites were damaged by Cyclone Ditwah.",
    "claim_category": "infrastructure_damage",
    "confidence": 0.85
  },
  {
    "claim_text": "Full recovery from Cyclone Ditwah is expected to take up to two years, according to Prime Minister Harini Amarasuriya.",
    "claim_category": "economic_impact",
    "confidence": 0.85
  },
  {
    "claim_text": "The Sri Lankan government established housing complexes for those who lost their homes due to Cyclone Ditwah.",
    "claim_category": "government_response",
    "confidence": 0.85
  },
  {
    "claim_text": "Cyclone Ditwah damaged 38 archaeological sites in Sri Lanka, with repair costs estimated at Rs. 222 million.",
    "claim_category": "infrastructure_damage",
    "confidence": 0.85
  },
  {
    "claim_text": "The health sector in Sri Lanka suffered an estimated Rs. 21 billion loss due to Cyclone Ditwah.",
    "claim_category": "economic_impact",
    "confidence": 0.85
  },
  {
    "claim_text": "Over 85,000 children in the Colombo district were affected by Cyclone Ditwah.",
    "claim_category": "casualties_and_displacement",
    "confidence": 0.85
  },
  {
    "claim_text": "The government and humanitarian partners coordinated a $35 million Humanitarian Priorities Plan for Cyclone Ditwah victims.",
    "claim_category": "humanitarian_aid",
    "confidence": 0.85
  },
  {
    "claim_text": "SLIIT donated Rs. 20 million to the 'Rebuilding Sri Lanka' Fund following Cyclone Ditwah.",
    "claim_category": "humanitarian_aid",
    "confidence": 0.85
  },
  {
    "claim_text": "The Road Development Authority (RDA) estimated it would take 18 months to reconstruct major bridges damaged by Cyclone Ditwah.",
    "claim_category": "infrastructure_damage",
    "confidence": 0.8
  },
  {
    "claim_text": "The opposition criticized the government for failing to act on advance forecasts and expert warnings about Cyclone Ditwah, exacerbating the disaster's impact.",
    "claim_category": "government_response",
    "confidence": 0.8
  },
  {
    "claim_text": "The Colombo Stock Exchange (CSE) experienced a 'weather-related disaster-induced pullback' due to the economic fallout from Cyclone Ditwah.",
    "claim_category": "economic_impact",
    "confidence": 0.8
  },
  {
    "claim_text": "The impact of Cyclone Ditwah on Sri Lanka's GDP is yet to be calculated by labour authorities.",
    "claim_category": "economic_impact",
    "confidence": 0.8
  },
  {
    "claim_text": "Cyclone Ditwah caused significant infrastructure damage requiring national connectivity restoration efforts.",
    "claim_category": "infrastructure_damage",
    "confidence": 0.8
  }
]